# input - არის მონაცემი რომელსაც იღებს პროგრამა.
# მაგალითად: კლავიატურაზე სიმბოლოების გამოყენებით პროგრამა იღებს მონაცემს.
# output - არის მონაცემი რომელიც პროგრამას გამოაქვს ეკრანზე.
# მაგალითად: დინამიკს გამოაქვს კომპიუტერიდან წამოსული სიგნალი რომელსაც გადმოგვცემს ხმის ფორმით.

# მომხმარებელს ვთხოვთ რომ შეიყვანოს თავისი სახელი.
name = input("enter your name: ")
print(name)
# მომხმარებელს ვთხოვთ რომ შეიყვანოს თავისი გვარი.
surname = input("enter your surname: ")
print(surname)

# მომხმარებლს ვთხოვთ რომ შემოიტანოს თავისი ასაკი.
age = int(input("Enter your age: "))
if age >= 18:
    print("you are an adult")
else:
    print("you are a kid")


# მომხმარებელს ვთხოვოთ რომ შემოიტანოს რაიმე რიცხვი.
a=int(input("enter number: "))
for i in range(0,a + 1):
    print(i)